#include <stdio.h>
#include <Windows.h>
int next();
int main(void)
{
	char name;
	printf("동훈이가 만들었지만 무슨 제목으로 할 지 몰라서 이따구로 적는 미연시\n");
	next();

	printf("??? : 잠깐만!!!!!!!");
	next();

	printf("멀리서 시끄럽게 소리를 지르는 여자아이가 주변에 있는 사람들의 시선을 신경쓰지 않은 채 나에게로 찾아온다.");
	next();

	printf("저 여자아이는 어릴 때부터 알던 소꿉친구이다.");
	next();

	printf("그냥 어렸을 때부터 알던 사이라 친해진 친구?");
	next();

	printf("매일 학교를 같이 가긴 했지만, 김윤찬이 고등학교로 들어와서 늦잠이 많아지는 바람에 기다려주기 힘들어졌다.");
	next();
	
	printf("김윤찬 : 또 늦잠을 잤어 ㅠㅠ..");
	next();

	printf("김윤찬 : 그래도 오늘은 따라잡았네!");
	next();

	printf("박선우 : 그래, 이번엔 내가 기다렸으니까.");
	next();

	printf("박선우 : 그리고 너가 그런 식으로 달려오면 사람들이 어떤 생각을 하겠어.");
	next();
	
	printf("김윤찬 : 알았어.");
	next();
	
	printf("김윤찬 : 그래도 날 기다려준 건 사실이잖아?");
	next();
	
	printf("김윤찬 : 너, 말과 다르게 되게 자상하다?");
	next();
	
	printf("시간이 지날수록 우리와 같이 등굣길을 걸으면서 이야기를 나누는 학생들이 늘어난다.");
	next();
	
	printf("김윤찬 : 혹시 동아리는 정했어?");
	next();
	
	printf("박선우 : 동아리?");
	next();
	
	printf("김윤찬 : 작년에 말했잖아 내년까지 안정하면 안된다고...");
	next();
	
	printf("박선우 : 관심도 없어서 알아보지도 않았는데?");
	next();
	
	printf("김윤찬 : 헤에?? 거짓말!");
	next();
	
	printf("나는 동아리에도 관심도 없고, 그냥 애니를 보거나 게임을 하면서 노는게 좋으니까...");
	next();
	
	printf("김윤찬 : 지금도 행복한 건 알겠지만 나중에 사회생활을 못해서 평생 백수가 될 수도 있단 말야...");
	next();
	
	printf("너무 극단적이다. 밴드부에 안들어오면 백수가 된다라는 이야기로 들리기도 하고...");
	next();
	
	printf("김윤찬 : 무슨 소리인지 알지?");
	next();
	
	printf("박선우 : 알았어, 알았어....");
	next();
	
	printf("박선우 : 너가 원한다면 동아리정도는 알아볼게.");
	next();

	printf("박선우 :  장담은 못해.");
	next();
	
	printf("김윤찬 : 최소한 노력은 해준다고 약속해 줄 수있어..?");
	next();
	
	printf("박선우 : 알았어.");
	next();
	
	printf("정신을 차리고 보니 벌써 7교시가 끝나는 종소리가 울린다.");
	next();
	
	printf("어느때와 다름없이 짐을 싸고 집을 갈려던 찰나....");
	next();
	
	printf("김윤찬 : 박선우!!!!!!!!!");
	next();
	
	printf("박선우 : ...?");
	next();
	
	printf("김윤찬 : 어디가?");
	next();
	
	printf("박선우 : 집");
	next();
	
	printf("김윤찬 : 동아리는? ");
	next();
	
	printf("박선우 : 동아리.. 아직 안정했어...");
	next();
	
	printf("김윤찬 : 따라와.");
	next();
	
	printf("박선우 : ㅇ..으응...");
	next();
	
	printf("김윤찬은 나의 손을 잡고 끌려가는듯 밴드부로 향한다.");
	next();
	
	printf("여자 1 : 뭐야 동아리에 온다는 애가 남자였어?"); //여자 1은 츤데레 여자 2는 교회눈나 조민성 여자 3은 부장 리더쉽이 강함 
	next();
	
	printf("김윤찬 : 이 친구는 @@@, 너 온다고 해서 컵케이크도 만들었더라구!");
	next();
	
	printf(" ");
	next();
	
	printf(" ");
	next();
	
	printf(" ");
	next();
	
	printf(" ");
	next();
}
int next()
{
	puts(" ");
	puts("[ 다음으로 가기 : Enter ]");
	getchar();
	system("cls");
}
