#include "AppBox.h"

void ebook()
{
	system("cls"); //made by hyunbin63

	puts("┌────────────────────────────────┐ ");
	puts("│             E-BOOK             │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("└────────────────────────────────┘");
	next();


	printf("6.25전쟁 과정\n\n\n\n 글쓴이:박선우\n\n\n");
	next();

	printf("1948년... 남한은 미국이, 북한은 소련이 장악을 하면서 한반도는 두개의 국가로 갈라졌다.\n\n\n");
	next();

	printf("38선이 그어진 후, 남북과의 군사 충돌이 자주 일어났다.\n\n\n");
	next();

	printf("그러던 어느날....\n\n\n");
	next();

	printf("1950년 6월25일 모두가 잠든 새벽. 계속되던 군사 대립에 북한의 남침이 일어났다.\n\n\n");
	next();

	printf("남한이 침략당한지 3일.. 남한은 꼼짝없이 수도를 빼앗기고 말았다.\n\n\n");
	next();

	printf("북한은 무서운 기세로 남쪽으로 넘어오기 시작했다.\n\n\n");
	next();

	printf("사태의 심각성을 알게된 미국은 유엔 안전보장이사회를 소집하여 16개 나라를 파병보냈다.\n\n\n");
	next();

	printf("사태가 나아질 기미가 보이지않자, 미국장관인 맥아더장군은 \"인천상륙작전\" 을 실행하였다.\n\n\n인천상륙작전: 상대의 보급로인 인천을 침략하여 상대의 주 보급로를 끊는 작전\n\n\n");
	next();

	printf("인천상륙작전에 성공한 미군과 국군은 그 기세를 몰아 북한 압록강까지 진격하였다.\n\n\n");
	next();

	printf("그런데, 위협을 느낀 중국이 중공군 26만 여명을 투입하여 \"인해전술\" 로 국군을 밀어붙히기 시작했다.\n\n\n");
	next();

	printf("인해전술에 밀린 국군과 미군은 철수하는 과정에서 동상으로 많은 장병들이 순국하였다.\n\n\n(1.4 후퇴)\n\n\n");
	next();

	printf("하지만 전력을 가다듬은 국군은 3월15일에 다시 수도를 회복하였다.(국군의 날)\n\n\n");
	next();

	printf("그 후(1951년 6월), 소련은 미국에게 휴전을 제안했고, 미국은 휴전을 성사했다.\n\n\n");
	next();

	printf("하지만 휴전선을 어디로 그어야할지 몰라 전쟁은 2년간 더 지속된 후에야(1953년7월13일)휴전이 성립되었다.\n\n\n");
	next();

	printf("전쟁의 피해는 막대했다. 양측 군인들의 사망자는 160만, 민간인 사망자는 99만, 전쟁고아 10만명, 수십만의 이산가족이 생겨났다.\n\n\n");
	next();

	printf("다시는 전쟁이 일어나지 않기를 바란다.\n\n\n");
	next();

	printf("......\n\n\n");
	next();

	puts("┌────────────────────────────────┐ ");
	puts("│               6.25             │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("│                                │ ");
	puts("└────────────────────────────────┘ ");

	puts("\n메인화면으로 돌아가려면 enter 키를 누르세요"); //made by hyunbin63
	getchar(); //made by hyunbin63
}